       IDENTIFICATION DIVISION.
       PROGRAM-ID. Seq1.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       
       PROCEDURE DIVISION.
              DISPLAY "Yuan Allego".
              DISPLAY "Yuan Allego".
              DISPLAY "Yuan Allego".
              DISPLAY "Yuan Allego".
              DISPLAY "Yuan Allego".
        STOP RUN.
        